# Определите, что будет напечатано в результате работы следующего фрагмента программы:

k = 5
s = 2
while k < 120:
     s = s + k
     k = k + 2
print(s)